13/data/attachments/af4a1287bce70f38.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ec84b77d-e8d8-4426-8a27-1b7fd5a87ea5</nif:username>
            <nif:friendToBeAdded>Carl_once_Friend_18650_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>